Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.1.45/edc/PIC32MZ1024EFG144.PIC
      <edc:SFRDef edc:_addr="0x1F810060" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IFS2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="IFS2" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCD5IF" edc:desc="" edc:mask="0x1" edc:name="ADCD5IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD6IF" edc:desc="" edc:mask="0x1" edc:name="ADCD6IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD7IF" edc:desc="" edc:mask="0x1" edc:name="ADCD7IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD8IF" edc:desc="" edc:mask="0x1" edc:name="ADCD8IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD9IF" edc:desc="" edc:mask="0x1" edc:name="ADCD9IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD10IF" edc:desc="" edc:mask="0x1" edc:name="ADCD10IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD11IF" edc:desc="" edc:mask="0x1" edc:name="ADCD11IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD12IF" edc:desc="" edc:mask="0x1" edc:name="ADCD12IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD13IF" edc:desc="" edc:mask="0x1" edc:name="ADCD13IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD14IF" edc:desc="" edc:mask="0x1" edc:name="ADCD14IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD15IF" edc:desc="" edc:mask="0x1" edc:name="ADCD15IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD16IF" edc:desc="" edc:mask="0x1" edc:name="ADCD16IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD17IF" edc:desc="" edc:mask="0x1" edc:name="ADCD17IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD18IF" edc:desc="" edc:mask="0x1" edc:name="ADCD18IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD19IF" edc:desc="" edc:mask="0x1" edc:name="ADCD19IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD20IF" edc:desc="" edc:mask="0x1" edc:name="ADCD20IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD21IF" edc:desc="" edc:mask="0x1" edc:name="ADCD21IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD22IF" edc:desc="" edc:mask="0x1" edc:name="ADCD22IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD23IF" edc:desc="" edc:mask="0x1" edc:name="ADCD23IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD24IF" edc:desc="" edc:mask="0x1" edc:name="ADCD24IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD25IF" edc:desc="" edc:mask="0x1" edc:name="ADCD25IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD26IF" edc:desc="" edc:mask="0x1" edc:name="ADCD26IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD27IF" edc:desc="" edc:mask="0x1" edc:name="ADCD27IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD28IF" edc:desc="" edc:mask="0x1" edc:name="ADCD28IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD29IF" edc:desc="" edc:mask="0x1" edc:name="ADCD29IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD30IF" edc:desc="" edc:mask="0x1" edc:name="ADCD30IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD31IF" edc:desc="" edc:mask="0x1" edc:name="ADCD31IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD32IF" edc:desc="" edc:mask="0x1" edc:name="ADCD32IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD33IF" edc:desc="" edc:mask="0x1" edc:name="ADCD33IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD34IF" edc:desc="" edc:mask="0x1" edc:name="ADCD34IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD35IF" edc:desc="" edc:mask="0x1" edc:name="ADCD35IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD36IF" edc:desc="" edc:mask="0x1" edc:name="ADCD36IF" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810070" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnn--nnnnnnnnnnn" edc:cname="IFS3" edc:desc="" edc:impl="0xffffe7ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000--00000000000" edc:name="IFS3" edc:nzwidth="32" edc:por="0000000000000000000--00000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCD37IF" edc:desc="" edc:mask="0x1" edc:name="ADCD37IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD38IF" edc:desc="" edc:mask="0x1" edc:name="ADCD38IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD39IF" edc:desc="" edc:mask="0x1" edc:name="ADCD39IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD40IF" edc:desc="" edc:mask="0x1" edc:name="ADCD40IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD41IF" edc:desc="" edc:mask="0x1" edc:name="ADCD41IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD42IF" edc:desc="" edc:mask="0x1" edc:name="ADCD42IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD43IF" edc:desc="" edc:mask="0x1" edc:name="ADCD43IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD44IF" edc:desc="" edc:mask="0x1" edc:name="ADCD44IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CPCIF" edc:desc="" edc:mask="0x1" edc:name="CPCIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CFDCIF" edc:desc="" edc:mask="0x1" edc:name="CFDCIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SBIF" edc:desc="" edc:mask="0x1" edc:name="SBIF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SPI1EIF" edc:desc="" edc:mask="0x1" edc:name="SPI1EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI1RXIF" edc:desc="" edc:mask="0x1" edc:name="SPI1RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI1TXIF" edc:desc="" edc:mask="0x1" edc:name="SPI1TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1EIF" edc:desc="" edc:mask="0x1" edc:name="U1EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1RXIF" edc:desc="" edc:mask="0x1" edc:name="U1RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1TXIF" edc:desc="" edc:mask="0x1" edc:name="U1TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1BIF" edc:desc="" edc:mask="0x1" edc:name="I2C1BIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1SIF" edc:desc="" edc:mask="0x1" edc:name="I2C1SIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1MIF" edc:desc="" edc:mask="0x1" edc:name="I2C1MIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNAIF" edc:desc="" edc:mask="0x1" edc:name="CNAIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNBIF" edc:desc="" edc:mask="0x1" edc:name="CNBIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNCIF" edc:desc="" edc:mask="0x1" edc:name="CNCIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNDIF" edc:desc="" edc:mask="0x1" edc:name="CNDIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNEIF" edc:desc="" edc:mask="0x1" edc:name="CNEIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNFIF" edc:desc="" edc:mask="0x1" edc:name="CNFIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNGIF" edc:desc="" edc:mask="0x1" edc:name="CNGIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNHIF" edc:desc="" edc:mask="0x1" edc:name="CNHIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNJIF" edc:desc="" edc:mask="0x1" edc:name="CNJIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNKIF" edc:desc="" edc:mask="0x1" edc:name="CNKIF" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xfffff7ff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
